{
  "backend/main.mo": "Empty Motoko actor serving as backend entry point.",
  "feature_evidence.json": "Feature evidence report mapping a portfolio update to affected files and related metadata.",
  "frontend-file-summaries.txt": "Collection of auto-generated summaries describing all major frontend portfolio components.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables and dark mode styles.",
  "frontend/index.html": "Base HTML document loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Main React component assembling all portfolio sections and lazy-loading the particle background.",
  "frontend/src/components/portfolio/AboutSection.tsx": "Animated About Me section describing the author's background and interests including SAL Institute of Technology and Engineering Research.",
  "frontend/src/components/portfolio/AchievementsSection.tsx": "Section listing achievements using FlipCard components in a responsive grid.",
  "frontend/src/components/portfolio/AnimatedCounter.tsx": "Animated counter that increments values when scrolled into view with reduced-motion support.",
  "frontend/src/components/portfolio/ContactSection.tsx": "Contact section showing email, GitHub, LinkedIn cards and a resume download button.",
  "frontend/src/components/portfolio/FlipCard.tsx": "Interactive card enabling front/back flipping with animations and accessibility controls.",
  "frontend/src/components/portfolio/Footer.tsx": "Renders a portfolio footer with navigation links, contact info, and smooth scrolling behavior.",
  "frontend/src/components/portfolio/HeroSection.tsx": "Displays the hero banner with typing animation, background image, CTAs, and smooth scroll navigation.",
  "frontend/src/components/portfolio/LeadershipSection.tsx": "Shows leadership metrics and ambassador roles using cards, counters, and styled sections.",
  "frontend/src/components/portfolio/Navbar.tsx": "Implements a responsive navbar with active-section highlighting and smooth scrolling across page sections.",
  "frontend/src/components/portfolio/ParticleBackground.tsx": "Draws animated particle effects on a fullscreen canvas with motion-reduction support.",
  "frontend/src/components/portfolio/ProjectCard.tsx": "Interactive project card with expand animation, tech badges, and links to GitHub or demos.",
  "frontend/src/components/portfolio/ProjectsSection.tsx": "Displays a grid of ProjectCard components inside a section wrapper.",
  "frontend/src/components/portfolio/ResearchInterestsSection.tsx": "Renders a research interests grid with animated cards using useInViewOnce. Each card displays an icon, title, and description with hover gradients.",
  "frontend/src/components/portfolio/SectionShell.tsx": "Provides a styled section wrapper with a title and container layout for portfolio sections.",
  "frontend/src/components/portfolio/SkillMeter.tsx": "Displays an animated skill bar that fills when scrolled into view. Uses useInViewOnce and supports delayed animation.",
  "frontend/src/components/portfolio/SkillsSection.tsx": "Renders categorized skill groups with icons and SkillMeters inside a SectionShell. Each group shows animated skill bars.",
  "frontend/src/data/projects.ts": "Exports an array of project metadata including titles, descriptions, technologies, and links/GitHub URLs.",
  "frontend/src/hooks/useActiveSection.ts": "Tracks the currently visible section using IntersectionObserver and returns the active section id.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useInViewOnce.ts": "Provides a ref and boolean that becomes true once the element enters view, respecting reduced-motion preferences.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's prefers-reduced-motion setting using a media query and updates on changes.",
  "frontend/src/hooks/useTypingText.ts": "Animates typing and deleting text cycles unless reduced motion is enabled, updating displayed text over time.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, dark mode colors, reduced-motion handling, and custom animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theme extensions for colors, fonts, animations, and integrates typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing versions, existing features, and a pending request to add a college name to portfolio content."
}